<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Exploring-database" data-toc-modified-id="Exploring-database-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Exploring database</a></span><ul class="toc-item"><li><span><a href="#List-of-customer-countries" data-toc-modified-id="List-of-customer-countries-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>List of customer countries</a></span></li><li><span><a href="#Top-5-albums" data-toc-modified-id="Top-5-albums-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Top 5 albums</a></span></li><li><span><a href="#Categorizing-customers-by-purchases" data-toc-modified-id="Categorizing-customers-by-purchases-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Categorizing customers by purchases</a></span></li><li><span><a href="#Playlists" data-toc-modified-id="Playlists-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Playlists</a></span></li></ul></li><li><span><a href="#Business-challenges" data-toc-modified-id="Business-challenges-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Business challenges</a></span><ul class="toc-item"><li><span><a href="#Which-new-albums-should-be-purchased?" data-toc-modified-id="Which-new-albums-should-be-purchased?-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Which new albums should be purchased?</a></span></li><li><span><a href="#Employee-sales-performance" data-toc-modified-id="Employee-sales-performance-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Employee sales performance</a></span></li><li><span><a href="#Sales-by-country" data-toc-modified-id="Sales-by-country-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Sales by country</a></span></li></ul></li></ul></div>

# Business Questions on Chinook Database (SQL)

In [2]:
%%capture
%load_ext sql
%sql sqlite:///chinook.db

## Exploring database

In [7]:
%%sql
SELECT
    name
    type
FROM sqlite_master
WHERE type IN ('table','view');

Done.

[('album',),
 ('artist',),
 ('customer',),
 ('employee',),
 ('genre',),
 ('invoice',),
 ('invoice_line',),
 ('media_type',),
 ('playlist',),
 ('playlist_track',),
 ('track',)]

### List of customer countries

In [7]:
%%sql
SELECT country
FROM customer
GROUP BY country;

 * sqlite:///chinook.db
Done.

[('Argentina',),
 ('Australia',),
 ('Austria',),
 ('Belgium',),
 ('Brazil',),
 ('Canada',),
 ('Chile',),
 ('Czech Republic',),
 ('Denmark',),
 ('Finland',),
 ('France',),
 ('Germany',),
 ('Hungary',),
 ('India',),
 ('Ireland',),
 ('Italy',),
 ('Netherlands',),
 ('Norway',),
 ('Poland',),
 ('Portugal',),
 ('Spain',),
 ('Sweden',),
 ('USA',),
 ('United Kingdom',)]

### Top 5 albums

In [26]:
%%sql
SELECT
    ta.album_title AS album,
    ta.artist_name AS artist,
    COUNT(*) tracks_purchased
FROM invoice_line il
INNER JOIN (
            SELECT
                t.track_id,
                al.title AS album_title,
                ar.name AS artist_name
            FROM track t
            INNER JOIN album al ON al.album_id = t.album_id
            INNER JOIN artist ar ON ar.artist_id = al.artist_id
           ) ta
           ON ta.track_id = il.track_id
GROUP BY 1, 2
ORDER BY 3 DESC LIMIT 5;

 * sqlite:///chinook.db
Done.

[('Are You Experienced?', 'Jimi Hendrix', 187),
 ('Faceless', 'Godsmack', 96),
 ('Mezmerize', 'System Of A Down', 93),
 ('Get Born', 'JET', 90),
 ('The Doors', 'The Doors', 83)]

### Categorizing customers by purchases

In [27]:
%%sql

SELECT c.first_name || " " || c.last_name AS customer_name,
       COUNT (i.invoice_id) AS number_of_purchases,
       SUM (i.total) AS total_spent,
       CASE
        WHEN sum(i.total) < 40 THEN 'small spender'
        WHEN sum(i.total) > 100 THEN 'big spender'
        ELSE 'regular'
        END
        AS customer_category
FROM invoice AS i
INNER JOIN customer c ON i.customer_id = c.customer_id
GROUP BY 1 ORDER BY 1;

 * sqlite:///chinook.db
Done.

[('Aaron Mitchell', 8, 70.28999999999999, 'regular'),
 ('Alexandre Rocha', 10, 69.3, 'regular'),
 ('Astrid Gruber', 9, 69.3, 'regular'),
 ('Bjørn Hansen', 9, 72.27000000000001, 'regular'),
 ('Camille Bernard', 9, 79.2, 'regular'),
 ('Daan Peeters', 7, 60.38999999999999, 'regular'),
 ('Dan Miller', 12, 95.03999999999999, 'regular'),
 ('Diego Gutiérrez', 5, 39.6, 'small spender'),
 ('Dominique Lefebvre', 9, 72.27, 'regular'),
 ('Eduardo Martins', 12, 60.39, 'regular'),
 ('Edward Francis', 13, 91.08, 'regular'),
 ('Ellie Sullivan', 12, 75.24000000000001, 'regular'),
 ('Emma Jones', 8, 68.31, 'regular'),
 ('Enrique Muñoz', 11, 98.01, 'regular'),
 ('Fernanda Ramos', 15, 106.91999999999999, 'big spender'),
 ('Frank Harris', 8, 74.25, 'regular'),
 ('Frank Ralston', 8, 71.28, 'regular'),
 ('František Wichterlová', 18, 144.54000000000002, 'big spender'),
 ('François Tremblay', 9, 99.99, 'regular'),
 ('Fynn Zimmermann', 10, 94.05000000000001, 'regular'),
 ('Hannah Schneider', 11, 85.14, 'regular'),
 ('Heather Leacock', 12, 92.07000000000001, 'regular'),
 ('Helena Holý', 12, 128.7, 'big spender'),
 ("Hugh O'Reilly", 13, 114.83999999999997, 'big spender'),
 ('Isabelle Mercier', 12, 73.25999999999999, 'regular'),
 ('Jack Smith', 12, 98.01, 'regular'),
 ('Jennifer Peterson', 9, 66.33, 'regular'),
 ('Joakim Johansson', 10, 75.24, 'regular'),
 ('Johannes Van der Berg', 10, 65.34, 'regular'),
 ('John Gordon', 10, 66.33, 'regular'),
 ('João Fernandes', 13, 102.96000000000001, 'big spender'),
 ('Julia Barnett', 10, 72.27, 'regular'),
 ('Kara Nielsen', 10, 37.61999999999999, 'small spender'),
 ('Kathy Chase', 11, 91.08000000000001, 'regular'),
 ('Ladislav Kovács', 10, 78.21, 'regular'),
 ('Leonie Köhler', 11, 82.17, 'regular'),
 ('Lucas Mancini', 9, 50.49, 'regular'),
 ('Luis Rojas', 13, 97.02000000000001, 'regular'),
 ('Luís Gonçalves', 13, 108.89999999999998, 'big spender'),
 ('Madalena Sampaio', 16, 82.17, 'regular'),
 ('Manoj Pareek', 13, 111.86999999999999, 'big spender'),
 ('Marc Dubois', 9, 64.35, 'regular'),
 ('Mark Philips', 10, 29.699999999999996, 'small spender'),
 ('Mark Taylor', 10, 81.18, 'regular'),
 ('Martha Silk', 11, 62.370000000000005, 'regular'),
 ('Michelle Brooks', 8, 79.2, 'regular'),
 ('Niklas Schröder', 9, 73.25999999999999, 'regular'),
 ('Patrick Gray', 9, 84.14999999999999, 'regular'),
 ('Phil Hughes', 11, 98.01, 'regular'),
 ('Puja Srivastava', 8, 71.28, 'regular'),
 ('Richard Cunningham', 12, 86.13000000000002, 'regular'),
 ('Robert Brown', 4, 40.59, 'regular'),
 ('Roberto Almeida', 11, 82.17, 'regular'),
 ('Stanisław Wójcik', 10, 76.22999999999999, 'regular'),
 ('Steve Murray', 9, 79.2, 'regular'),
 ('Terhi Hämäläinen', 11, 79.2, 'regular'),
 ('Tim Goyer', 9, 54.449999999999996, 'regular'),
 ('Victor Stevens', 10, 76.23, 'regular'),
 ('Wyatt Girard', 11, 99.99, 'regular')]

### Playlists

In [29]:
%%sql

WITH data_playlist AS
    (
     SELECT p.playlist_id,
            p.name AS playlist_name,
            t.name AS track_name,
            (t.milliseconds / 1000) AS length_seconds
     FROM playlist AS p
     LEFT JOIN playlist_track AS pt ON pt.playlist_id = p.playlist_id
     LEFT JOIN track AS t ON t.track_id = pt.track_id
     )
     
SELECT playlist_id,
       playlist_name,
       COUNT(track_name) AS number_of_tracks,
       SUM (length_seconds) AS length_seconds
FROM data_playlist
GROUP BY 1, 2
ORDER BY 1 ASC;

 * sqlite:///chinook.db
Done.

[(1, 'Music', 3290, 876049),
 (2, 'Movies', 0, None),
 (3, 'TV Shows', 213, 500987),
 (4, 'Audiobooks', 0, None),
 (5, '90’s Music', 1477, 397970),
 (6, 'Audiobooks', 0, None),
 (7, 'Movies', 0, None),
 (8, 'Music', 3290, 876049),
 (9, 'Music Videos', 1, 294),
 (10, 'TV Shows', 213, 500987),
 (11, 'Brazilian Music', 39, 9464),
 (12, 'Classical', 75, 21736),
 (13, 'Classical 101 - Deep Cuts', 25, 6742),
 (14, 'Classical 101 - Next Steps', 25, 7565),
 (15, 'Classical 101 - The Basics', 25, 7429),
 (16, 'Grunge', 15, 4114),
 (17, 'Heavy Metal Classic', 26, 8189),
 (18, 'On-The-Go 1', 1, 197)]

## Business challenges

### Which new albums should be purchased?

The Chinook record store has just signed a deal with a new record label, and you've been tasked with selecting the first three albums that will be added to the store, from a list of four. All four albums are by artists that don't have any tracks in the store right now - we have the artist names, and the genre of music they produce:

|Artist Name |Genre
--- | ---
|Regal|Hip-Hop|
|Red Tone|Punk|
|Meteor and the Girls|Pop
|Slim Jim Bites|Blues

The record label specializes in artists from the USA, and they have given Chinook some money to advertise the new albums in the USA, so we're interested in finding out which genres sell the best in the USA.

We need to write a query to find out which genres sell the most tracks in the USA, write up a summary of our findings, and make a recommendation for the three artists whose albums we should purchase for the store.

In [13]:
%%sql

WITH usa_sales AS
   (
    SELECT il.* FROM invoice_line AS il
    INNER JOIN invoice AS i ON il.invoice_id = i.invoice_id
    INNER JOIN customer AS c ON i.customer_id = c.customer_id
    WHERE c.country = "USA"
   )
    
SELECT
    g.name genre,
    COUNT(us.invoice_line_id) AS tracks_sold,
    CAST(COUNT(us.invoice_line_id) AS FLOAT) / (
        SELECT COUNT(*) FROM usa_sales
    ) percentage_sold
FROM usa_sales AS us
INNER JOIN track AS t ON t.track_id = us.track_id
INNER JOIN genre AS g ON g.genre_id = t.genre_id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * sqlite:///chinook.db
Done.

[('Rock', 561, 0.5337773549000951),
 ('Alternative & Punk', 130, 0.12369172216936251),
 ('Metal', 124, 0.11798287345385347),
 ('R&B/Soul', 53, 0.05042816365366318),
 ('Blues', 36, 0.03425309229305423),
 ('Alternative', 35, 0.03330161750713606),
 ('Pop', 22, 0.02093244529019981),
 ('Latin', 22, 0.02093244529019981),
 ('Hip Hop/Rap', 20, 0.019029495718363463),
 ('Jazz', 14, 0.013320647002854425)]

Based on the sales of tracks across different genres in the USA, we should purchase the new albums by the following artists:
- Red Tone (Punk)
- Slim Jim Bites (Blues)
- Meteor and the Girls (Pop)

It's worth keeping in mind that combined, these three genres only make up only 17% of total sales, so we should be on the lookout for artists and albums from the 'rock' genre, which accounts for 53% of sales.

### Employee sales performance

Each customer for the Chinook store gets assigned to a sales support agent within the company when they first make a purchase. We have been asked to analyze the purchases of customers belonging to each employee to see if any sales support agent is performing either better or worse than the others.

We should consider whether any extra columns from the employee table explain any variance which could be indicative of the employee performance. Let's try with "hire_date".

In [3]:
%%sql

WITH employee_sales AS
    (
     SELECT
         i.customer_id,
         c.support_rep_id,
         SUM(i.total) total
     FROM invoice AS i
     INNER JOIN customer AS c ON i.customer_id = c.customer_id
     GROUP BY 1,2
    )

SELECT
    e.first_name || " " || e.last_name employee,
    e.hire_date,
    SUM(es.total) total_sales
FROM employee_sales AS es
INNER JOIN employee AS e ON e.employee_id = es.support_rep_id
GROUP BY 1;

 * sqlite:///chinook.db
Done.

[('Jane Peacock', '2017-04-01 00:00:00', 1731.5099999999998),
 ('Margaret Park', '2017-05-03 00:00:00', 1584.0000000000002),
 ('Steve Johnson', '2017-10-17 00:00:00', 1393.92)]

There is a 20% difference in sales between Jane (the top employee) and Steve (the bottom employee); they were hired the same year, so the difference of months shouldn't be a reason for this percentage.

### Sales by country

In [4]:
%%sql

WITH country_or_other AS
    (
     SELECT
       CASE
           WHEN (
                 SELECT count(*)
                 FROM customer
                 where country = c.country
                ) = 1 THEN "Other"
           ELSE c.country
       END AS country,
       c.customer_id,
       il.*
     FROM invoice_line il
     INNER JOIN invoice AS i ON i.invoice_id = il.invoice_id
     INNER JOIN customer AS c ON c.customer_id = i.customer_id
    )

SELECT
    country,
    customers,
    total_sales,
    average_order
FROM
    (
    SELECT
        country,
        count(distinct customer_id) customers,
        SUM(unit_price) total_sales,
        SUM(unit_price) / COUNT(distinct invoice_id) average_order,
        CASE
            WHEN country = "Other" THEN 1
            ELSE 0
        END AS sort
    FROM country_or_other
    GROUP BY country
    ORDER BY sort ASC, total_sales DESC
    );

 * sqlite:///chinook.db
Done.

[('USA', 13, 1040.490000000008, 7.942671755725252),
 ('Canada', 8, 535.5900000000034, 7.047236842105309),
 ('Brazil', 5, 427.68000000000245, 7.011147540983647),
 ('France', 5, 389.0700000000021, 7.781400000000042),
 ('Germany', 4, 334.6200000000016, 8.161463414634186),
 ('Czech Republic', 2, 273.24000000000103, 9.108000000000034),
 ('United Kingdom', 3, 245.52000000000078, 8.768571428571457),
 ('Portugal', 2, 185.13000000000022, 6.3837931034482835),
 ('India', 2, 183.1500000000002, 8.72142857142858),
 ('Other', 15, 1094.9400000000085, 7.448571428571486)]

There are some countries to keep an eye on:
- Czech Republic
- UK
- India

Our sample is not big enough to risk in large budget marketing campaigns, but we should start some smaller ones to get more customers and confirm the potential market.